#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_service_account.api-invoker: Refreshing state... [id=projects/trial-cicd-a/serviceAccounts/api-invoker@trial-cicd-a.iam.gserviceaccount.com]
google_cloud_run_service.api-run: Refreshing state... [id=locations/us-central1/namespaces/trial-cicd-a/services/api-run]
google_compute_network.vpc_network: Refreshing state... [id=projects/trial-cicd-a/global/networks/cicd-network]
google_compute_instance.decoy: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/decoy]
google_compute_firewall.vpc-allow-internal: Refreshing state... [id=projects/trial-cicd-a/global/firewalls/vpc-allow-internal]
google_compute_firewall.frontend: Refreshing state... [id=projects/trial-cicd-a/global/firewalls/http-firewall]
google_compute_firewall.develop: Refreshing state... [id=projects/trial-cicd-a/global/firewalls/ssh-firewall]
google_compute_instance.nginx_instance: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/reverse-proxy]
google_cloud_run_service_iam_binding.invokeer: Refreshing state... [id=v1/projects/trial-cicd-a/locations/us-central1/services/api-run/roles/run.invoker]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_firewall.vpc-allow-internal has been changed
  ~ resource "google_compute_firewall" "vpc-allow-internal" {
        id                      = "projects/trial-cicd-a/global/firewalls/vpc-allow-internal"
        name                    = "vpc-allow-internal"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
      + target_tags             = []
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.decoy has been changed
  ~ resource "google_compute_instance" "decoy" {
      ~ cpu_platform         = "Intel Haswell" -> "Unknown CPU Platform"
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy"
        name                 = "decoy"
        tags                 = [
            "dev",
        ]
        # (14 unchanged attributes hidden)


      ~ network_interface {
            name               = "nic0"
            # (4 unchanged attributes hidden)

          ~ access_config {
              - nat_ip       = "146.148.52.201" -> null
                # (1 unchanged attribute hidden)
            }
        }


        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.api-run will be updated in-place
  ~ resource "google_cloud_run_service" "api-run" {
        id       = "locations/us-central1/namespaces/trial-cicd-a/services/api-run"
        name     = "api-run"
        # (3 unchanged attributes hidden)


      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation  = 0 -> null
              - labels      = {} -> null
            }

          ~ spec {
              - container_concurrency = 80 -> null

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance.sub-decoy["decoy-a"] will be created
  + resource "google_compute_instance" "sub-decoy" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "decoy-a"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu20-telegraf-decoy"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "cicd-network"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = "TERMINATE"
          + preemptible         = true
        }
    }

  # google_compute_instance.sub-decoy["decoy-b"] will be created
  + resource "google_compute_instance" "sub-decoy" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "decoy-b"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu20-telegraf-decoy"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "cicd-network"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = "TERMINATE"
          + preemptible         = true
        }
    }

  # google_compute_instance.sub-decoy["decoy-c"] will be created
  + resource "google_compute_instance" "sub-decoy" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "decoy-c"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu20-telegraf-decoy"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "cicd-network"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = "TERMINATE"
          + preemptible         = true
        }
    }

  # google_compute_instance.sub-decoy["decoy-d"] will be created
  + resource "google_compute_instance" "sub-decoy" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "f1-micro"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "decoy-d"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu20-telegraf-decoy"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "cicd-network"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = false
          + on_host_maintenance = "TERMINATE"
          + preemptible         = true
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marltake, Action: `pull_request`, Working Directory: ``, Workflow: `terraform CI/CD`*